<template>
  <div class="root">
    <h2>第一章 总则</h2>
    <h3>一、目的</h3>
    <p>本协议规定了公司及其用户对本网站（以下简称“公司”）提供的相关服务（以下简称“服务”）的使用条款和条件，用户均已认真阅读并同意将其作为确定双方权利义务的依据。</p>
    <h3>二、协议变更或终止</h3>
    <p>本协议的条款应在公司的服务登录订阅网站上公布，或以其他方式通知用户，并且在用户接受这些条款后生效。</p>
    <p>本公司有权随时对本协议内容或发布的其他服务条款及操作规则的内容进行变更，只要不违反相关法律。</p>
    <p>如果公司变更协议条款和条件，则应提前通知用户修改期限和修改原因，变更时将在公司网站内显著位置发布公告，变更自公告发布之时生效。</p>
    <p>公司应当按照前款规定通知客户修改条款，如用户继续使用本公司提供的服务即视为用户同意该等内容变更。</p>
    <p>如用户不同意变更后的内容则用户有权终止用户协议，可以注销公司账户、停止使用公司服务。</p>
    <h3>三、定义条款</h3>
    <p>定义条款专业术语如下：</p>
    <p>用户：接受并同意本协议全部条款及不时发布和更新的法律条款和操作规则、通过公司网进行代币质押和数据存储的会员。</p>
    <p>用户登录：用户使用filenet钱包或纸条的keystore和密码登录账号，并按要求填写相关信息并确认同意履行相关用户协议的过程。</p>
    <p>ID：这是由公司批准的用于客户识别和服务使用的字母和数字的组合。</p>
    <p>用户密码：这是由公司批准的用于客户身份识别和保护客户信息的字母和数字组合。</p>
    <h2>第二章 服务使用和接受申请</h2>
    <h3>四、用户合同</h3>
    <p>用户应根据公司指定的输入项输入个人信息并同意相关条款</p>
    <p>使用合同成立需要用户ID确认，才能成为正式用户</p>
    <p>如果您未满19岁，则可能会受限于使用公司提供的与代币质押和文件存储相关的服务</p>
    <h3>五、使用申请</h3>
    <p>通过公司规定的内容，输入信息，并同意本条款</p>
    <p>所有在线注册表上的客户信息都被视为真实信息，未输入真实信息的用户将不受法律保护，并可能被限制使用该服务</p>
    <p>如果用户使用虚假信息，一旦被发现，公司有权暂停服务或终止协议。如危害任何一方利益，用户将承担所有法律责任。</p>
    <p>公司可以通过电子邮件，信件，电话等方式向客户提供有本公司相关服务的各种信息</p>
    <h3>六、客户信息和申请批准</h3>
    <p>同意使用客户信息</p>
    <p>公司有权按照合同规定使用用户信息，并向用户提供本合同规定的服务。</p>
    <p>客户信息可能会提供给公司并存储在公司的附属公司，以方便客户使用与公司保存，但需要事先通知用户并征求用户的同意。</p>
    <p>公司有权向用户发送短信等通知消息，如果用户不愿意接收消息，可以主动退定。</p>
    <p>用户拥有随时查看并修改个人信息的权利。</p>
    <h3>七、终止和取消使用合同</h3>
    <p>使用合同应由客户或公司终止。</p>
    <p>由客户终止使用合同所造成的损害应由终止使用合同的客户承担</p>
    <p>当客户希望终止合同时，客户必须通过在线方式向公司申请终止合同</p>
    <p>本公司可以在客户有以下行为时，终止使用服务或限制服务的使用或终止使用合同</p>
    <p>（A）是否有以下的违反</p>
    <p>窃取他人的服务号码和密码</p>
    <p>故意干扰本服务的运作</p>
    <p>用户使用虚假信息</p>
    <p>故意传播有损公共秩序和道德的内容</p>
    <p>当客户计划或实施使用服务以阻碍国家利益或社会公共利益时</p>
    <p>传播大量信息或传播广告信息以干扰服务的稳定运行</p>
    <p>发送有害信息，导致信息或通信设备故障，故意发送有害的计算机病毒</p>
    <p>未经公司事先同意，从公司的服务信息中获得的信息并复制，非法传播或商业使用</p>
    <p>侵犯公司，其他客户或第三方的知识产权</p>
    <p>违反公司的使用条款，包括本协议</p>
    <p>如果您收到长期休眠用户的通知，您在通知期限内没有对使用该服务做出声明</p>
    <p>（B）以下每个分段</p>
    <p>如果操作员或管理员认为不适合使用</p>
    <p>客观地判断它与犯罪有关的行为</p>
    <p>违反有关法律的行为</p>
    <p>暂停或限制服务</p>
    <p>①如果公司希望限制使用，公司应通过指定原因，日期和时间以及书写或使用电话或主页信息功能来通知客户或代理人</p>
    <p>但是，如果公司认识到有必要紧急中止服务的使用，可能会在未经前款规定的情况下限制服务的使用</p>
    <p>③如果被告知暂停使用服务的客户或其代理人有异议暂停，他/她可以提出上诉</p>
    <p>④公司在暂停期内确认暂停使用的理由已经解决的，应当立即终止</p>
    <p>终止使用合同</p>
    <p>①如果相同的破坏行为重复两次或更多次,公司有权停止或限制对该用户服务，或者如果其原因是未在30天内纠正，或者，如果有一个违反1②（A）的，公司有权终止使用合同</p>
    <p>②如果公司终止使用合同，则取消了客户登记。本公司将在此情况下通知用户，保留用户在到期日前进行电话咨询的权利。</p>
    <h2>第三章 用户义务</h2>
    <h3>八、客户的身份和密码管理责任</h3>
    <p>用户应保管好个人ID和密码，因个人疏忽导致密码和ID泄露的，公司概不负责</p>
    <p>用户一旦发现个人信息泄露，可立刻通知公司并遵从公司指示进行操作</p>
    <p>就第2款而言，用户信息泄露未能及时通知公司或通知公司不遵从公司指导而造成的不利情况公司概不负责</p>
    <h3>九、提供资料</h3>
    <p>本公司可以提供以下服务信息：公司通过电子邮件或信函的方式向客户提供服务信息，如果客户不需要，可以选择退出</p>
    <p>用户在使用公司服务时，拥有从公司获取电子邮件或信函的方式或许公司提供的服务信息，如果用户不需要，可以选择退出。</p>
    <p>代币质押服务</p>
    <p>文件存储服务</p>
    <p>由本公司确定并提供给客户的服务</p>
  </div>
</template>
<style lang="less" scoped>
  .root {
    width: 100%;

    h2 {
      font-weight: bold;
      font-size: 20px;
      margin: 1em 0;
    }

    h3 {
      font-weight: bold;
      margin: 0.5em 0;
    }

    p {
      margin-bottom: 0;
    }
  }
</style>
