<template>
  <div class="root">
    <h3>1.一般规则</h3>
    <p>
      本网站（以下简称“公司”）会时刻保护用户个人信息的安全，当公司向用户提供服务时，我们需要收集和维护个人信息，使用您的个人数据，以便我们通过平台软件、API(应用程序接口)、产品和/或功能(“服务”)为您提供访问和应用程序服务。因此公司通过隐私政策披露在服务时如何使用个人信息及通过何种方式来保护个人信息安全。</p>
    <p>隐私政策可能会根据规定作出相应更改，隐私政策更改后用户可在网站登录页随时查看，如有任何疑问，请随时与我们联系。</p>
    <h3>2.收集个人信息协议</h3>
    <p>公司使用用户的个人信息，需要征求用户同意，在网站登录页条款“隐私政策”页面会提供用户个人信息协议，如您已注册filenet钱包或纸条并使用我们提供的服务，则表示您同意收集个人信息。</p>
    <h3>3.个人信息收集目的和使用</h3>
    <p>
      公司收集、处理和存储的个人数据，是通过您使用我们的服务所取得的，并且已经获得了您的同意。这些个人数据可能包括您的联系方式、您提供的身份信息的副本或来源于可获得的公开访问数据库、您的政府部门颁发的身份证号码，护照号码，电子邮件地址：确认您的身份并确认您的客户身份或与您的设备或互联网服务相关的任何信息（如IP地址和MAC号码）。公司使用个人数据与您沟通，并管理、履行、改进以及为您制定个性化服务。</p>
    <h3>4.防止欺诈性用户，防止未经授权用户使用</h3>
    <p>当用户完成filenet钱包或纸条注册&nbsp;使用我们的服务时，我们会收到提供服务所必需的在线信息。收到的基本信息包括您的姓名，电子邮件地址等。我们不收集侵犯人权的敏感个人信息。如果必须收集这些信息，我们会事先征求您的同意。在任何情况下，您输入的信息都不会用于其他用途，也不会被泄露出去。</p>
    <h3>5.分享和提供收集的个人信息</h3>
    <p>公司在收集和使用个人信息时，未经用户同意，不得向第三方提供用户信息，不得超出协议规定的信息使用范围。</p>
    <p>以下特殊情况除外：</p>
    <p>在相关法律要求的情况下（例如政府/调查机构根据适用法律通过合法程序提出要求）;</p>
    <p>用户同意提前发布；</p>
    <p>违反服务条款或运营原则，如服务条款和网站上发布的任何其他服务；</p>
    <p>如果您必须通过披露您的个人信息，来维护您的法律权益时；</p>
    <p>必要时根据服务规定结算费用；</p>
    <p>统计书写，学术研究或市场研究有必要以不可识别的形式提供具体的个人信息</p>
    <p>
      公司可能会提供或与其分支机构或合作伙伴分享个人信息，以便为用户提供更好的服务。如果我们提供或分享您的个人信息，会事先通知您分支机构是什么，会对哪些个人信息项目进行分享，为什么这样的个人信息会分享，用户将被一一告知，并征求用户同意。如果用户不同意，我们将不会将您的个人信息提供给其它机构。</p>
    <h3>6.关于用户的个人信息管理（修改、删除等）</h3>
    <p>用户可以随时登录网站，对个人信息进行更改。也可以通过电子邮件或书面形式向负责人提出请求，我们将派相关负责人按用户要求进行更改，但是，客户ID和真实姓名等身份信息不可更改。</p>
    <p>用户可随时终止协议，停止让提供服务的第三方使用您的个人信息，也可以通过电子邮件，电话，传真或其他方式终止协议，但必须提供身份证明和电子邮件地址。</p>
    <h3>7.关于cookies操作的事项</h3>
    <p>为了提供为客户量身定制的服务，我们使用“cookies”（cookies）来不时存储和检索信息。我们确定您的&nbsp;&nbsp;计算机是否与cookie管理有关，但不会识别。</p>
    <p>用户可以选择“cookies”在网页浏览器中选择[工具]>&nbsp;[Internet选项]>&nbsp;[安全]>&nbsp;[用户定义的级别]来接受所有的cookies，每次保存一个cookie，或者拒绝存储所有的cookies。如果您拒绝存储所有的cookies，您将无法通过cookies使用我们提供的服务。</p>
    <h3>8.确保个人信息安全的措施</h3>
    <p>根据相关的规定，采取以下技术，管理防护措施确保安全：</p>
    <p>人员管理措施：最大限度地减少和培训个人信息处理人员</p>
    <p class="indent">我们指定处理个人信息的员工，并将其限制在负责人处；</p>
    <p>实施管理个人信息的措施：定期进行自我审计</p>
    <p class="indent">我们定期（季度）进行自己的审计，以确保处理个人信息的安全性</p>
    <p>内部管理计划的制定和实施</p>
    <p class="indent">我们已经制定并实施了安全处理个人信息的内部管理计划</p>
    <p>个人信息的加密</p>
    <p class="indent">用户的个人信息经过加密存储和管理，使得只有用户本人能够使用，并对重要数据的使用单独提供安全功&nbsp;能，例如对文件和传输数据进行加密或者使用文件锁定功能</p>
    <p>防止黑客攻击的技术措施</p>
    <p class="indent">公司安装安全程序，定期更新和检查，当公司系统受到来自外部系统的入侵时，会通过加密和反之入侵技术组织入侵，避免由于黑客攻击或计算机病毒入侵导致的个人信息泄漏。</p>
    <p>限制访问个人信息</p>
    <p class="indent">我们采取必要措施，对通过授予，修改和删除等方式访问个人信息的数据库系统进行限制，并通过使用入侵防护系统来控制未经授权的外部访问&nbsp;</p>
    <p>保持连接日志和防止伪造</p>
    <p class="indent">个人信息处理系统访问记录至少保留六个月，并使用安全技术加密来防止通过伪造和盗窃方式造成访问记录丢失。</p>
    <p class="indent">使用加密手段来保护文档安全</p>
    <p class="indent">我们将存储个人信息和辅助存储介质的文档保存在安全的地方</p>
    <p>禁止未经授权的人访问</p>
    <p class="indent">我们将个人信息保留在独立的物理的存储位置，并为其设置访问控制程序。</p>
    <h3>9.个人信息管理员和负责人</h3>
    <p>我们正在尽最大的努力确保用户个人信息的安全，如您发现信息使用异常，请及时与公司客服联系</p>
    <p>用户ID密码由用户私人保管，任何人不得以任何方式索要用户密码，用户需要时刻保护密码的安全，不要泄露给他人。</p>
    <p>如您ID密码泄露，我们可进行技术补救，但由于基础网络危险（如黑客攻击）导致意外事故，我们不承担任何责任。</p>
  </div>
</template>
<style lang="less" scoped>
  .root {
    width: 100%;

    h2 {
      font-weight: bold;
      margin: 1em 0;
    }

    h3 {
      font-weight: bold;
      margin: 0.5em 0;
    }

    p {
      margin-bottom: 0;

      &.indent {
        text-indent: 2.5em;
      }
    }
  }
</style>
